IDEA StatiCa Open Model
MatSteelAUS.MaterialStrength Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material strength for specific thickness of plate
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public MaterialStrengthProperty MaterialStrength { get; set; }
Public Property MaterialStrength As MaterialStrengthProperty
	Get
	Set
public:
property MaterialStrengthProperty^ MaterialStrength {
	MaterialStrengthProperty^ get ();
	void set (MaterialStrengthProperty^ value);
}
Property Value
Type: MaterialStrengthProperty
See Also
Reference
MatSteelAUS Class
IdeaRS.OpenModel.Material Namespace